articles/Learning-Perl.org
#+TITLE: Learning Perl(持续更新)
#+DATE:
* 总述：
:PROPERTIES:
  :UNNUMBERED:
:END:
这篇文章是我在阅读 /Learning Perl/ (/Randal Schwartz, Tom Phoenix, brain d foy, 2008, O'Reilly Media/ =978-0-596-52010-6=)(又称小骆驼书) 时做的笔记。

当然通过阅读这些笔记可能使你比起阅读原书更加快速的上手Perl，但是如果你有足够的时间我会推荐去阅读原书来形成比较流畅而且牢固的知识体系，而且我可能会在这篇笔记中填入一些自己先入为主的观念，这对你的学习可能会造成一点影响。

如果你找到错误或者不严谨的表述，欢迎你来信告诉我。我的联系方式可以在 =About= 页面中找到。
* CH.1 Introduction
这一章没有多少有关Perl技术上的论述。

大部分都是对于本书、其作者以及Perl的介绍和几页FAQ，所以在这里跳过。

有兴趣的读者可以去阅读原书。
* CH.2 Scalar Data
当然这里所指的Scalar与数学、物理领域内的Scalar并不相同。Scalar只是对Perl当中一种数据泛类型的称呼。
Scalar通常（大部分情况下）以数字或字符串的形式表现。这里我们可以先将数字与字符串独立审视，就像其他的编程语言那样。
** Numbers
我们可以先看数字这部分。
*** Decimal Numbers
在Perl，所有的数字内部都是以相同的格式存在。你可以指定整数或者浮点数，但是在Perl内部都是以双精度浮点数（ =double-precision floating-point value= ）进行计算的。
所以可以理解为对于Perl不存在整数。所有的“整数”都是以 =DPFP= 类型进行计算的。

所以以下这些数字在Perl都是合法的。
=25, 25.5, 25.255, 25.0, 25.000, 25e25, -25e25, -25e-25=

在Perl中，数字通过下划线标记位数是允许的。
例如：

=1000000= 可以被写为 =1_000_000= ，这在Perl内部是相同的两个数字。
*** Nondecimal Integer
在编程中，非十进制数字使用最广泛的有：二进制 =binary= 、八进制 =octal= 、十六进制 =hexademical= 。
二进制用 =0b= 标识，八进制用 =0= ，十六进制用 =0x= 。所以以下的数字都是 *相同* 的。

#+BEGIN_SRC sh
0b1010 012 0xA 10 10.000
#+END_SRC

当然，对于非十进制的数字也可以用下划线标记位数，例如 =0b10_11_10_00= 是合法的。

需要注意的是，所谓的 ="Leading zero" Indicator= 只针对于普通的Literal数据，自动的字符串->数字变换是不支持的。也就是说你不可以将 ="0b11"= 这个字符串与 =3= 等同，但是 =0b11= 与 ="3"= 可以。
你可以使用 =oct()= 与 =hex()= 函数进行字符串到非十进制数字之间的转换。
*** Numeric Operators
Perl当然支持最普通的四则运算 =+ - * /= 与模运算 =%= ，当然也支持浮点数与整数混合运算。
在浮点数进行模运算时，Perl会自动将浮点数取整，所以 =15.6 % 2.4= 与 =15 % 2= 结果相同。

Perl同时也支持幂运算，例如 =2**3= 结果为 =8= 。

当你需要计算负数的分数幂的时候，你可以调用 =Math::Complex= 模块进行复数运算。

Perl还有其他一些数字运算符，当我们需要的时候会进行讲解。
** Strings
字符串可以理解为串在一起的一堆字符。
*** Single and Double Quoted Strings.
原书中有一段话：
#+BEGIN_QUOTE
This is in accordance with the principle of “no built-in limits” that Perl follows at every opportunity.
#+END_QUOTE
所以你既可以在一段字符串中加入可打印的字符，也可以加入不可打印的字符，比如二进制数据，然后对他们进行各种操作。这在Perl内都是合法的。

Perl内的字符串有两种表示形式， =Single-Quoted String Literals= 与 =Double-Quoted String Literals= 。

在单引号字符串中，只支持单引号 ='= 与反斜杠 =\= 的字符转义，所以，单引号字符串是最简单最纯粹的字符串表示形式。

然而，在双引号字符串中，支持所有的转义字符，换行 =\n= ,制表符Tab =\t=,和对ASCII值的引用等。

同时，你可以在双引号字符串中插入变量，所以，

#+BEGIN_SRC perl
$foo = "bar";
print "$foo is bar";
#+END_SRC

结果会输出 =bar is bar= 。

*** String Operators
字符串之间可以通过 =.= 进行连接，对，就是一个点。
所以：

#+BEGIN_SRC perl
"hello"."world" == "hel"."lowo"."rld"
#+END_SRC

字符串可以用 =x= 字符进行复制倍增， =x= 前的Literal会被视为字符或字符串，其后的Literal会被视为数字，所以：

#+BEGIN_SRC perl
"foo" x 3 == "foo" x "3" == "foofoofoo"
"5" x "3" == 5 x "3" == 5 x 3 == 5 x 3.3 == 5 x "3.3" == 555
#+END_SRC
当倍增的数字小于1时，会输出空字符串 =""= 。

这是关于Perl一个神奇的特性。
*** Automatic Conversion Between Numbers and Strings
关于这部分，原书有很好的诠释:
#+BEGIN_QUOTE
For the most part, Perl automatically converts between numbers and strings as needed.How does it know which is needed? It all depends upon the operator being used on thescalar value. If an operator expects a number (like + does), Perl will see the value as anumber. If an operator expects a string (like . does), Perl will see the value as a string.So you don’t need to worry about the difference between numbers and strings; just usethe proper operators, and Perl will make it all work.
#+END_QUOTE

所以:

#+BEGIN_SRC perl
"12" * "3" == 12 * 3 == 36
"12foo" * "3bar" == 36
#+END_SRC

但是在执行第二条计算的时候，Perl会抛出一个Warning： =Argument "3bar" isn't numeric in multiplication (*)=
所以可以视为，当一个数字与字母混合的字符串被转换为字符时，Perl会在字符串头部寻识别数字，如果没有则返回0.

** Perl's Built-in Warnings
在这里需要插入一个Perl内置警告的单元。

如果你要开启Perl的内置警告，可以在运行脚本时使用 =-w= 参数，或者直接在脚本头部添加 =-w= 参数，例如

#+BEGIN_SRC sh
$ perl -w some_script
#+END_SRC

或者：

#+BEGIN_SRC perl
#!/usr/bin/perl -w
#+END_SRC

甚至简略为：

#+BEGIN_SRC perl
#!perl -w
#+END_SRC

在Perl5.6或更新的Perl中，你可以这样写：

#+BEGIN_SRC perl
#!/usr/bin/perl
use warnings;
#+END_SRC

当你需要更长的诊断类描述时，可以这样写：

#+BEGIN_SRC perl
#!/usr/bin/perl
use diagnostics;
#+END_SRC

显然，这样做会使程序运行得更慢一些，当你不需要或者已经编写或Debug完了程序，应该注释掉这一行。

但是对于这种Diagnostic有一种优化便是使用 =-M= 参数，原书对于 =-M= 参数的诠释是这样的：
#+BEGIN_QUOTE
A further optimization can be had by using one of Perl’s command-line options, -M, toload the pragma only when needed instead of editing the source code each time toenable and disable diagnostics.
#+END_QUOTE
