public/articles/Learning-Perl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-07 Sun 01:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning Perl(持续更新)</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Learning Perl(持续更新)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org090ae63">总述：</a></li>
<li><a href="#org84a0877">1. CH.1 Introduction</a></li>
<li><a href="#org55ccded">2. CH.2 Scalar Data</a>
<ul>
<li><a href="#org4facca0">2.1. Numbers</a>
<ul>
<li><a href="#org2d0ba48">2.1.1. Decimal Numbers</a></li>
<li><a href="#orgba45517">2.1.2. Nondecimal Integer</a></li>
<li><a href="#orgd2c22b2">2.1.3. Numeric Operators</a></li>
</ul>
</li>
<li><a href="#org3d90198">2.2. Strings</a>
<ul>
<li><a href="#org4679b98">2.2.1. Single and Double Quoted Strings.</a></li>
<li><a href="#orgb969b76">2.2.2. String Operators</a></li>
<li><a href="#orgda5c849">2.2.3. Automatic Conversion Between Numbers and Strings</a></li>
</ul>
</li>
<li><a href="#orgffa2503">2.3. Perl's Built-in Warnings</a></li>
<li><a href="#org221d9b7">2.4. Scalar Variables</a></li>
<li><a href="#org750c322">2.5. Scalar Assignment</a></li>
<li><a href="#org520f66e">2.6. Output with print</a></li>
<li><a href="#orgec86462">2.7. Interpolation of Scalar Variables into Strings</a></li>
<li><a href="#org1ed8b7f">2.8. Operator Precedence and Associativity</a></li>
<li><a href="#org6bb7cdf">2.9. Comparison Operators</a></li>
<li><a href="#org6f01dcf">2.10. The if Control Structure</a></li>
<li><a href="#orga87633e">2.11. Getting User Input</a></li>
<li><a href="#orgfd6c90d">2.12. The chomp Operator</a></li>
<li><a href="#orgd02e188">2.13. The while Control Structure</a></li>
<li><a href="#orge079a8a">2.14. The undel Value</a></li>
<li><a href="#org4fd2e0a">2.15. The defined Function</a></li>
</ul>
</li>
<li><a href="#org70813c4">3. CH.3 List and Arrays</a>
<ul>
<li><a href="#orgf9ccf2b">3.1. List</a></li>
<li><a href="#org4acef21">3.2. 调用数列中的元素</a></li>
<li><a href="#org454aa94">3.3. Special Array Indices</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org090ae63" class="outline-2">
<h2 id="org090ae63">总述：</h2>
<div class="outline-text-2" id="text-org090ae63">
<p>
这篇文章是我在阅读 <i>Learning Perl</i> (<i>Randal Schwartz, Tom Phoenix, brain d foy, 2008, O'Reilly Media</i> <code>978-0-596-52010-6</code>)(又称小骆驼书) 时做的笔记。
</p>

<p>
当然通过阅读这些笔记可能使你比起阅读原书更加快速的上手Perl，但是如果你有足够的时间我会推荐去阅读原书来形成比较流畅而且牢固的知识体系，而且我可能会在这篇笔记中填入一些自己先入为主的观念，这对你的学习可能会造成一点影响。
</p>

<p>
如果你找到错误或者不严谨的表述，欢迎你来信告诉我。我的联系方式可以在 <code>About</code> 页面中找到。
</p>
</div>
</div>
<div id="outline-container-org84a0877" class="outline-2">
<h2 id="org84a0877"><span class="section-number-2">1.</span> CH.1 Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
这一章没有多少有关Perl技术上的论述。
</p>

<p>
大部分都是对于本书、其作者以及Perl的介绍和几页FAQ，所以在这里跳过。
</p>

<p>
有兴趣的读者可以去阅读原书。
</p>
</div>
</div>
<div id="outline-container-org55ccded" class="outline-2">
<h2 id="org55ccded"><span class="section-number-2">2.</span> CH.2 Scalar Data</h2>
<div class="outline-text-2" id="text-2">
<p>
当然这里所指的Scalar与数学、物理领域内的Scalar并不相同。Scalar只是对Perl当中一种数据泛类型的称呼。
Scalar通常（大部分情况下）以数字或字符串的形式表现。这里我们可以先将数字与字符串独立审视，就像其他的编程语言那样。
</p>
</div>
<div id="outline-container-org4facca0" class="outline-3">
<h3 id="org4facca0"><span class="section-number-3">2.1.</span> Numbers</h3>
<div class="outline-text-3" id="text-2-1">
<p>
我们可以先看数字这部分。
</p>
</div>
<div id="outline-container-org2d0ba48" class="outline-4">
<h4 id="org2d0ba48"><span class="section-number-4">2.1.1.</span> Decimal Numbers</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
在Perl，所有的数字内部都是以相同的格式存在。你可以指定整数或者浮点数，但是在Perl内部都是以双精度浮点数（ <code>double-precision floating-point value</code> ）进行计算的。
所以可以理解为对于Perl不存在整数。所有的“整数”都是以 <code>DPFP</code> 类型进行计算的。
</p>

<p>
所以以下这些数字在Perl都是合法的。
<code>25, 25.5, 25.255, 25.0, 25.000, 25e25, -25e25, -25e-25</code>
</p>

<p>
在Perl中，数字通过下划线标记位数是允许的。
例如：
</p>

<p>
<code>1000000</code> 可以被写为 <code>1_000_000</code> ，这在Perl内部是相同的两个数字。
</p>
</div>
</div>
<div id="outline-container-orgba45517" class="outline-4">
<h4 id="orgba45517"><span class="section-number-4">2.1.2.</span> Nondecimal Integer</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
在编程中，非十进制数字使用最广泛的有：二进制 <code>binary</code> 、八进制 <code>octal</code> 、十六进制 <code>hexademical</code> 。
二进制用 <code>0b</code> 标识，八进制用 <code>0</code> ，十六进制用 <code>0x</code> 。所以以下的数字都是 <b>相同</b> 的。
</p>

<div class="org-src-container">
<pre class="src src-sh">0b1010 012 0xA 10 10.000
</pre>
</div>

<p>
当然，对于非十进制的数字也可以用下划线标记位数，例如 <code>0b10_11_10_00</code> 是合法的。
</p>

<p>
需要注意的是，所谓的 <code>"Leading zero" Indicator</code> 只针对于普通的Literal数据，自动的字符串-&gt;数字变换是不支持的。也就是说你不可以将 <code>"0b11"</code> 这个字符串与 <code>3</code> 等同，但是 <code>0b11</code> 与 <code>"3"</code> 可以。
你可以使用 <code>oct()</code> 与 <code>hex()</code> 函数进行字符串到非十进制数字之间的转换。
</p>
</div>
</div>
<div id="outline-container-orgd2c22b2" class="outline-4">
<h4 id="orgd2c22b2"><span class="section-number-4">2.1.3.</span> Numeric Operators</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Perl当然支持最普通的四则运算 <code>+ - * /</code> 与模运算 <code>%</code> ，当然也支持浮点数与整数混合运算。
在浮点数进行模运算时，Perl会自动将浮点数取整，所以 <code>15.6 % 2.4</code> 与 <code>15 % 2</code> 结果相同。
</p>

<p>
Perl同时也支持幂运算，例如 <code>2**3</code> 结果为 <code>8</code> 。
</p>

<p>
当你需要计算负数的分数幂的时候，你可以调用 <code>Math::Complex</code> 模块进行复数运算。
</p>

<p>
Perl还有其他一些数字运算符，当我们需要的时候会进行讲解。
</p>
</div>
</div>
</div>
<div id="outline-container-org3d90198" class="outline-3">
<h3 id="org3d90198"><span class="section-number-3">2.2.</span> Strings</h3>
<div class="outline-text-3" id="text-2-2">
<p>
字符串可以理解为串在一起的一堆字符。
</p>
</div>
<div id="outline-container-org4679b98" class="outline-4">
<h4 id="org4679b98"><span class="section-number-4">2.2.1.</span> Single and Double Quoted Strings.</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
原书中有一段话：
</p>
<blockquote>
<p>
This is in accordance with the principle of “no built-in limits” that Perl follows at every opportunity.
</p>
</blockquote>
<p>
所以你既可以在一段字符串中加入可打印的字符，也可以加入不可打印的字符，比如二进制数据，然后对他们进行各种操作。这在Perl内都是合法的。
</p>

<p>
Perl内的字符串有两种表示形式， <code>Single-Quoted String Literals</code> 与 <code>Double-Quoted String Literals</code> 。
</p>

<p>
在单引号字符串中，只支持单引号 <code>'</code> 与反斜杠 <code>\</code> 的字符转义，所以，单引号字符串是最简单最纯粹的字符串表示形式。
</p>

<p>
然而，在双引号字符串中，支持所有的转义字符，换行 <code>\n</code> ,制表符Tab <code>\t</code>,和对ASCII值的引用等。
</p>

<p>
同时，你可以在双引号字符串中插入变量，所以，
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span> = <span style="color: #00c06f;">"bar"</span>;
print <span style="color: #00c06f;">"$foo is bar"</span>;
</pre>
</div>

<p>
结果会输出 <code>bar is bar</code> 。
</p>
</div>
</div>

<div id="outline-container-orgb969b76" class="outline-4">
<h4 id="orgb969b76"><span class="section-number-4">2.2.2.</span> String Operators</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
字符串之间可以通过 <code>.</code> 进行连接，对，就是一个点。
所以：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #00c06f;">"hello"</span>.<span style="color: #00c06f;">"world"</span> == <span style="color: #00c06f;">"hel"</span>.<span style="color: #00c06f;">"lowo"</span>.<span style="color: #00c06f;">"rld"</span>
</pre>
</div>

<p>
字符串可以用 <code>x</code> 字符进行复制倍增， <code>x</code> 前的Literal会被视为字符或字符串，其后的Literal会被视为数字，所以：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #00c06f;">"foo"</span> x 3 == <span style="color: #00c06f;">"foo"</span> x <span style="color: #00c06f;">"3"</span> == <span style="color: #00c06f;">"foofoofoo"</span>
<span style="color: #00c06f;">"5"</span> x <span style="color: #00c06f;">"3"</span> == 5 x <span style="color: #00c06f;">"3"</span> == 5 x 3 == 5 x 3.3 == 5 x <span style="color: #00c06f;">"3.3"</span> == 555
</pre>
</div>
<p>
当倍增的数字小于1时，会输出空字符串 <code>""</code> 。
</p>

<p>
这是关于Perl一个神奇的特性。
</p>
</div>
</div>
<div id="outline-container-orgda5c849" class="outline-4">
<h4 id="orgda5c849"><span class="section-number-4">2.2.3.</span> Automatic Conversion Between Numbers and Strings</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
关于这部分，原书有很好的诠释:
</p>
<blockquote>
<p>
For the most part, Perl automatically converts between numbers and strings as needed.How does it know which is needed? It all depends upon the operator being used on thescalar value. If an operator expects a number (like + does), Perl will see the value as anumber. If an operator expects a string (like . does), Perl will see the value as a string.So you don’t need to worry about the difference between numbers and strings; just usethe proper operators, and Perl will make it all work.
</p>
</blockquote>

<p>
所以:
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #00c06f;">"12"</span> * <span style="color: #00c06f;">"3"</span> == 12 * 3 == 36
<span style="color: #00c06f;">"12foo"</span> * <span style="color: #00c06f;">"3bar"</span> == 36
</pre>
</div>

<p>
但是在执行第二条计算的时候，Perl会抛出一个Warning： <code>Argument "3bar" isn't numeric in multiplication (*)</code>
所以可以视为，当一个数字与字母混合的字符串被转换为字符时，Perl会在字符串头部寻识别数字，如果没有则返回0.
</p>
</div>
</div>
</div>

<div id="outline-container-orgffa2503" class="outline-3">
<h3 id="orgffa2503"><span class="section-number-3">2.3.</span> Perl's Built-in Warnings</h3>
<div class="outline-text-3" id="text-2-3">
<p>
在这里需要插入一个Perl内置警告的单元。
</p>

<p>
如果你要开启Perl的内置警告，可以在运行脚本时使用 <code>-w</code> 参数，或者直接在脚本头部添加 <code>-w</code> 参数，例如
</p>

<div class="org-src-container">
<pre class="src src-sh">$ perl -w some_script
</pre>
</div>

<p>
或者：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #a8a8a8;">#</span><span style="color: #a8a8a8;">!/usr/bin/perl -w</span>
</pre>
</div>

<p>
甚至简略为：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #a8a8a8;">#</span><span style="color: #a8a8a8;">!perl -w</span>
</pre>
</div>

<p>
在Perl5.6或更新的Perl中，你可以这样写：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #a8a8a8;">#</span><span style="color: #a8a8a8;">!/usr/bin/perl</span>
<span style="color: #b6a0ff;">use</span> warnings;
</pre>
</div>

<p>
当你需要更长的诊断类描述时，可以这样写：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #a8a8a8;">#</span><span style="color: #a8a8a8;">!/usr/bin/perl</span>
<span style="color: #b6a0ff;">use</span> diagnostics;
</pre>
</div>

<p>
显然，这样做会使程序运行得更慢一些，当你不需要或者已经编写或Debug完了程序，应该注释掉这一行。
</p>

<p>
但是对于这种Diagnostic有一种优化便是使用 <code>-M</code> 参数，原书对于 <code>-M</code> 参数的诠释是这样的：
</p>
<blockquote>
<p>
A further optimization can be had by using one of Perl’s command-line options, -M, toload the pragma only when needed instead of editing the source code each time toenable and disable diagnostics.
</p>
</blockquote>
</div>
</div>
