articles/Learning-Perl.org
** Scalar Variables
#+BEGIN_QUOTE
A variable is a name for a container that holds one or more values. The name of thevariable stays the same throughout the program, but the value or values contained inthat variable typically change over and over again throughout the execution of theprogram.
#+END_QUOTE

所以在Perl中变量的特性与用法在其他编程语言中并没有区别。

在Perl中一个scalar variable只能储存一个scalar value,

但是Perl中的Scalar Variable需要一个代表变量名的符号，以便与其他Literals区别开来，在这里使用的是美元符号 =$= 。
在Perl中这类符号称作 =Sigil= , 对于不同的变量需要不同的Sigil，在后面
变量名（通常使用的表述是 =Perl Identifier= ）不可以以数字开头，而且大小写区分。
** Scalar Assignment
对于Scalar Variable的赋值操作，与其他的编程语言大致相似。赋值操作通过 === 来进行，例如：

#+BEGIN_SRC perl
$foo = 3;
$foo = $foo + 3;
$foo += 3;
$foo = "bar";
$foo = $foo . "foo";
$foo = $foo x 3;
$foo x= 3;
$foo .= "foo";
#+END_SRC

类似的操作都是合法的。
** Output with print
Perl中的 =print()= 函数与其他语言中的类似，而且可以携带或不携带括号 =()= 。例如：

#+BEGIN_SRC perl
print "hello world\n";    # 输出为 “hello world”以及一个新行。

print "the answer is ";
print 2*3;
print ".\n";    # 输出为“the answer is 6.”以及一个新行。

# 当然也可以这么操作。

print "the answer is". 6*7 .".\n";

# 输出是相同的。
#+END_SRC

** Interpolation of Scalar Variables into Strings
在双引号字符串中引用scalar variable，可以自动替换为该变量的值。例如：

#+BEGIN_SRC perl
$foo = "bar";
print "$foo is bar";
#+END_SRC

结果会输出 =bar is bar= 。

在被引用的变量没有被赋值或声明时，会以 =""= (空字符串)或 =0= 来代替。

*注意*,这种Interpolation只能在双引号字符串中进行，单引号字符串是没有这种效果的。

同时，在这种Interpolation中，Perl会寻找所谓的 /Longest Possible Variable/ ，所以为了避免程序出Bug，你可能想要用一些可用的分割符来进行变量名与字符串之间的分割。
例如：


#+BEGIN_SRC perl
$foo = 1;
$foobar = 2;
print "$foos";        #会输出“1s”
print "$foobar";      #会输出“2”
print "$foo"."bar";   #会输出“1bar”
print "${foo}bar";    #会输出“1bar”
#+END_SRC

** Operator Precedence and Associativity
操作优先级这方面没有什么好讲的，Perl的各种操作优先级（包括二进制位操作）都与C语言相同。
#+BEGIN_QUOTE
So should you just memorize the precedence chart? No! Nobody actually does that.Instead, just use parentheses when you don’t remember the order of operations, orwhen you’re too busy to look in the chart. After all, if you can’t remember it withoutthe parentheses, your maintenance programmer is going to have the same trouble. Sobe nice to your maintenance programmer: you may be that person one day.
#+END_QUOTE
** Comparison Operators
对于数字之间的比较，Perl有以下几种操作符：

#+BEGIN_SRC perl
< <= == >= !=
#+END_SRC

他们进行判断的返回值都是真或假 =true / false= 。

对于字符串之间的比较，Perl有以下集中操作符：

#+BEGIN_SRC perl
lt le eq ge gt ne
#+END_SRC

分别代表 =less than , less or equal , equal , greater or equal , greater than , not equal= 。

Perl中字符串的比较方法是从头至为比较单个字符的ASCII值，而且需要注意的是在ASCII码表中大写字母在小写字母前面，所以表达式 ="Ab" lt "ab"= 返回 =true= 。

** The if Control Structure
又到了喜闻乐见的条件选择环节。

在Perl中， =if= 结构与C语言大致相同，例如：

#+BEGIN_SRC perl
  if (<condition>){
      # do something;
  }  elsif (<condition>) {
      # do another something;
  }  else {
      # ok let's do this;
  }
#+END_SRC

在Perl的if语句中，括号是必须的。

Condition 返回的可以为True or False，当Condition为一个数字，除0外所有数字均为 =True= ，当Condition为一个字符串，除了空字符串 =''= 以外所有字符串均为真，否则（该Scalar Data为除字符串或数字以外的值）将该值转换为数字或字符串然后在进行判断。

而且这里有一个little trick：在Perl中字符 ='0'= 与数字 =0= 是可互相转化的，所以 ='0'= 是Perl中唯一可以被判断为假的非空字符串。

** Getting User Input
在Perl中获取输入有一种很简单的方式， =<STDIN>= ，例如：

#+BEGIN_SRC perl
$foo = <STDIN>;
#+END_SRC

需要注意的是，<STDIN>返回的是一串字符串，以换行符做结尾，所以<STDIN>的返回值不可能是空字符串，最短返回值为 ='\n'= 。

但是在大部分情况下并不需要这个结尾的换行符，所以我们需要另一个函数去去除输入时的换行符。
** The chomp Operator
=chomp()= 的使用方法类似这样：

#+BEGIN_SRC perl
$foo = <STDIN>;
chomp($foo);    # 这里的括号是可以省略的。
#+END_SRC

或者再短一点：

#+BEGIN_SRC perl
chomp($foo=<STDIN>);    #这里的括号不可以省略。
#+END_SRC

作为一个函数， =chomp()= 是有返回值的，它会返回去除的字符的数量————通常情况下这个数字为1,因为在有多个换行符作为末尾的情况下， =chomp()= 也只会移除一个。但是当输入为空字符串或无末尾换行符的字符串， =chomp()= 会返回0。

** The while Control Structure
又是一个十分常用的结构。同样，Perl的while语句也和C类似：

#+BEGIN_SRC perl
while(<condition>){
    # do something;
}
#+END_SRC

=condition= 的判断方式已经介绍过，这里不再赘述。

** The undel Value
Perl的一个很有趣的特性便是这个 =undef= 值，它适用于引用未声明或赋值的变量时，可以被自动转换为 =0= 或 =''= ，所以：

#+BEGIN_SRC perl
$unassigned_variable = "foo";

$another_unassigned_variable .= "foo";
#+END_SRC

两者是相等的。

原书中写道：
#+BEGIN_QUOTE
/Many operators return undef when the arguments are out of range or don’t make sense.... But you should know that when warnings are turned on, Perl willtypically warn about unusual uses of the undefined value, since that may indicate abug. For example, simply copying undef from one variable into another isn’t a problem,but trying to print it would generally cause a warning./
#+END_QUOTE

** The defined Function
=<STDIN>= 操作通常会返回一个字符串，但是也有特例。当你在扫描一个文件时，如果遇到 =EOF= ，那么 =<STDIN>= 会返回 =undef= ，这时你可以用 =defined()= 函数来判断某个变量是否被赋值。
=defined()= 当输入的值为 =undef= 时返回假，其他情况均返回真。

当然，你也可以为某个变量赋值 =undef= ，虽然这与没声明该变量没有什么区别，但是某些情况下这个特性是很有用的。

