public/articles/Learning-Perl.html
<div id="outline-container-org221d9b7" class="outline-3">
<h3 id="org221d9b7"><span class="section-number-3">2.4.</span> Scalar Variables</h3>
<div class="outline-text-3" id="text-2-4">
<blockquote>
<p>
A variable is a name for a container that holds one or more values. The name of thevariable stays the same throughout the program, but the value or values contained inthat variable typically change over and over again throughout the execution of theprogram.
</p>
</blockquote>

<p>
所以在Perl中变量的特性与用法在其他编程语言中并没有区别。
</p>

<p>
在Perl中一个scalar variable只能储存一个scalar value,
</p>

<p>
但是Perl中的Scalar Variable需要一个代表变量名的符号，以便与其他Literals区别开来，在这里使用的是美元符号 <code>$</code> 。
在Perl中这类符号称作 <code>Sigil</code> , 对于不同的变量需要不同的Sigil，在后面
变量名（通常使用的表述是 <code>Perl Identifier</code> ）不可以以数字开头，而且大小写区分。
</p>
</div>
</div>
<div id="outline-container-org750c322" class="outline-3">
<h3 id="org750c322"><span class="section-number-3">2.5.</span> Scalar Assignment</h3>
<div class="outline-text-3" id="text-2-5">
<p>
对于Scalar Variable的赋值操作，与其他的编程语言大致相似。赋值操作通过 <code>=</code> 来进行，例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span> = 3;
$<span style="color: #79a8ff;">foo</span> = $<span style="color: #79a8ff;">foo</span> + 3;
$<span style="color: #79a8ff;">foo</span> += 3;
$<span style="color: #79a8ff;">foo</span> = <span style="color: #00c06f;">"bar"</span>;
$<span style="color: #79a8ff;">foo</span> = $<span style="color: #79a8ff;">foo</span> . <span style="color: #00c06f;">"foo"</span>;
$<span style="color: #79a8ff;">foo</span> = $<span style="color: #79a8ff;">foo</span> x 3;
$<span style="color: #79a8ff;">foo</span> x= 3;
$<span style="color: #79a8ff;">foo</span> .= <span style="color: #00c06f;">"foo"</span>;
</pre>
</div>

<p>
类似的操作都是合法的。
</p>
</div>
</div>
<div id="outline-container-org520f66e" class="outline-3">
<h3 id="org520f66e"><span class="section-number-3">2.6.</span> Output with print</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Perl中的 <code>print()</code> 函数与其他语言中的类似，而且可以携带或不携带括号 <code>()</code> 。例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">print <span style="color: #00c06f;">"hello world\n"</span>;    <span style="color: #a8a8a8;"># &#36755;&#20986;&#20026; &#8220;hello world&#8221;&#20197;&#21450;&#19968;&#20010;&#26032;&#34892;&#12290;</span>

print <span style="color: #00c06f;">"the answer is "</span>;
print 2*<span style="color: #79a8ff;">3</span>;
print <span style="color: #00c06f;">".\n"</span>;    <span style="color: #a8a8a8;"># &#36755;&#20986;&#20026;&#8220;the answer is 6.&#8221;&#20197;&#21450;&#19968;&#20010;&#26032;&#34892;&#12290;</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">&#24403;&#28982;&#20063;&#21487;&#20197;&#36825;&#20040;&#25805;&#20316;&#12290;</span>

print <span style="color: #00c06f;">"the answer is"</span>. 6*<span style="color: #79a8ff;">7</span> .<span style="color: #00c06f;">".\n"</span>;

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">&#36755;&#20986;&#26159;&#30456;&#21516;&#30340;&#12290;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec86462" class="outline-3">
<h3 id="orgec86462"><span class="section-number-3">2.7.</span> Interpolation of Scalar Variables into Strings</h3>
<div class="outline-text-3" id="text-2-7">
<p>
在双引号字符串中引用scalar variable，可以自动替换为该变量的值。例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span> = <span style="color: #00c06f;">"bar"</span>;
print <span style="color: #00c06f;">"$foo is bar"</span>;
</pre>
</div>

<p>
结果会输出 <code>bar is bar</code> 。
</p>

<p>
在被引用的变量没有被赋值或声明时，会以 <code>""</code> (空字符串)或 <code>0</code> 来代替。
</p>

<p>
<b>注意</b>,这种Interpolation只能在双引号字符串中进行，单引号字符串是没有这种效果的。
</p>

<p>
同时，在这种Interpolation中，Perl会寻找所谓的 <i>Longest Possible Variable</i> ，所以为了避免程序出Bug，你可能想要用一些可用的分割符来进行变量名与字符串之间的分割。
例如：
</p>


<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span> = 1;
$<span style="color: #79a8ff;">foobar</span> = 2;
print <span style="color: #00c06f;">"$foos"</span>;        <span style="color: #a8a8a8;">#&#20250;&#36755;&#20986;&#8220;1s&#8221;</span>
print <span style="color: #00c06f;">"$foobar"</span>;      <span style="color: #a8a8a8;">#&#20250;&#36755;&#20986;&#8220;2&#8221;</span>
print <span style="color: #00c06f;">"$foo"</span>.<span style="color: #00c06f;">"bar"</span>;   <span style="color: #a8a8a8;">#&#20250;&#36755;&#20986;&#8220;1bar&#8221;</span>
print <span style="color: #00c06f;">"${foo}bar"</span>;    <span style="color: #a8a8a8;">#&#20250;&#36755;&#20986;&#8220;1bar&#8221;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ed8b7f" class="outline-3">
<h3 id="org1ed8b7f"><span class="section-number-3">2.8.</span> Operator Precedence and Associativity</h3>
<div class="outline-text-3" id="text-2-8">
<p>
操作优先级这方面没有什么好讲的，Perl的各种操作优先级（包括二进制位操作）都与C语言相同。
</p>
<blockquote>
<p>
So should you just memorize the precedence chart? No! Nobody actually does that.Instead, just use parentheses when you don’t remember the order of operations, orwhen you’re too busy to look in the chart. After all, if you can’t remember it withoutthe parentheses, your maintenance programmer is going to have the same trouble. Sobe nice to your maintenance programmer: you may be that person one day.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org6bb7cdf" class="outline-3">
<h3 id="org6bb7cdf"><span class="section-number-3">2.9.</span> Comparison Operators</h3>
<div class="outline-text-3" id="text-2-9">
<p>
对于数字之间的比较，Perl有以下几种操作符：
</p>

<div class="org-src-container">
<pre class="src src-perl">&lt; &lt;= == &gt;= !=
</pre>
</div>

<p>
他们进行判断的返回值都是真或假 <code>true / false</code> 。
</p>

<p>
对于字符串之间的比较，Perl有以下集中操作符：
</p>

<div class="org-src-container">
<pre class="src src-perl">lt le eq ge gt ne
</pre>
</div>

<p>
分别代表 <code>less than , less or equal , equal , greater or equal , greater than , not equal</code> 。
</p>

<p>
Perl中字符串的比较方法是从头至为比较单个字符的ASCII值，而且需要注意的是在ASCII码表中大写字母在小写字母前面，所以表达式 <code>"Ab" lt "ab"</code> 返回 <code>true</code> 。
</p>
</div>
</div>

<div id="outline-container-org6f01dcf" class="outline-3">
<h3 id="org6f01dcf"><span class="section-number-3">2.10.</span> The if Control Structure</h3>
<div class="outline-text-3" id="text-2-10">
<p>
又到了喜闻乐见的条件选择环节。
</p>

<p>
在Perl中， <code>if</code> 结构与C语言大致相同，例如：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #00d3d0;">if</span> (&lt;<span style="color: #b6a0ff;">condition</span>&gt;){
    <span style="color: #a8a8a8;"># do something;</span>
}  <span style="color: #00d3d0;">elsif</span> (&lt;<span style="color: #b6a0ff;">condition</span>&gt;) {
    <span style="color: #a8a8a8;"># do another something;</span>
}  <span style="color: #00d3d0;">else</span> {
    <span style="color: #a8a8a8;"># ok let's do this;</span>
}
</pre>
</div>

<p>
在Perl的if语句中，括号是必须的。
</p>

<p>
Condition 返回的可以为True or False，当Condition为一个数字，除0外所有数字均为 <code>True</code> ，当Condition为一个字符串，除了空字符串 <code>''</code> 以外所有字符串均为真，否则（该Scalar Data为除字符串或数字以外的值）将该值转换为数字或字符串然后在进行判断。
</p>

<p>
而且这里有一个little trick：在Perl中字符 <code>'0'</code> 与数字 <code>0</code> 是可互相转化的，所以 <code>'0'</code> 是Perl中唯一可以被判断为假的非空字符串。
</p>
</div>
</div>

<div id="outline-container-orga87633e" class="outline-3">
<h3 id="orga87633e"><span class="section-number-3">2.11.</span> Getting User Input</h3>
<div class="outline-text-3" id="text-2-11">
<p>
在Perl中获取输入有一种很简单的方式， <code>&lt;STDIN&gt;</code> ，例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span> = &lt;<span style="color: #b6a0ff;">STDIN</span>&gt;;
</pre>
</div>

<p>
需要注意的是，&lt;STDIN&gt;返回的是一串字符串，以换行符做结尾，所以&lt;STDIN&gt;的返回值不可能是空字符串，最短返回值为 <code>'\n'</code> 。
</p>

<p>
但是在大部分情况下并不需要这个结尾的换行符，所以我们需要另一个函数去去除输入时的换行符。
</p>
</div>
</div>
<div id="outline-container-orgfd6c90d" class="outline-3">
<h3 id="orgfd6c90d"><span class="section-number-3">2.12.</span> The chomp Operator</h3>
<div class="outline-text-3" id="text-2-12">
<p>
<code>chomp()</code> 的使用方法类似这样：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span> = &lt;<span style="color: #b6a0ff;">STDIN</span>&gt;;
chomp($<span style="color: #79a8ff;">foo</span>);    <span style="color: #a8a8a8;"># &#36825;&#37324;&#30340;&#25324;&#21495;&#26159;&#21487;&#20197;&#30465;&#30053;&#30340;&#12290;</span>
</pre>
</div>

<p>
或者再短一点：
</p>

<div class="org-src-container">
<pre class="src src-perl">chomp($<span style="color: #79a8ff;">foo</span>=&lt;<span style="color: #b6a0ff;">STDIN</span>&gt;);    <span style="color: #a8a8a8;">#&#36825;&#37324;&#30340;&#25324;&#21495;&#19981;&#21487;&#20197;&#30465;&#30053;&#12290;</span>
</pre>
</div>

<p>
作为一个函数， <code>chomp()</code> 是有返回值的，它会返回去除的字符的数量————通常情况下这个数字为1,因为在有多个换行符作为末尾的情况下， <code>chomp()</code> 也只会移除一个。但是当输入为空字符串或无末尾换行符的字符串， <code>chomp()</code> 会返回0。
</p>
</div>
</div>

<div id="outline-container-orgd02e188" class="outline-3">
<h3 id="orgd02e188"><span class="section-number-3">2.13.</span> The while Control Structure</h3>
<div class="outline-text-3" id="text-2-13">
<p>
又是一个十分常用的结构。同样，Perl的while语句也和C类似：
</p>

<div class="org-src-container">
<pre class="src src-perl"><span style="color: #00d3d0;">while</span>(&lt;<span style="color: #b6a0ff;">condition</span>&gt;){
    <span style="color: #a8a8a8;"># do something;</span>
}
</pre>
</div>

<p>
<code>condition</code> 的判断方式已经介绍过，这里不再赘述。
</p>
</div>
</div>

<div id="outline-container-orge079a8a" class="outline-3">
<h3 id="orge079a8a"><span class="section-number-3">2.14.</span> The undel Value</h3>
<div class="outline-text-3" id="text-2-14">
<p>
Perl的一个很有趣的特性便是这个 <code>undef</code> 值，它适用于引用未声明或赋值的变量时，可以被自动转换为 <code>0</code> 或 <code>''</code> ，所以：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">unassigned_variable</span> = <span style="color: #00c06f;">"foo"</span>;

$<span style="color: #79a8ff;">another_unassigned_variable</span> .= <span style="color: #00c06f;">"foo"</span>;
</pre>
</div>

<p>
两者是相等的。
</p>

<p>
原书中写道：
</p>
<blockquote>
<p>
<i>Many operators return undef when the arguments are out of range or don’t make sense&#x2026;. But you should know that when warnings are turned on, Perl willtypically warn about unusual uses of the undefined value, since that may indicate abug. For example, simply copying undef from one variable into another isn’t a problem,but trying to print it would generally cause a warning.</i>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org4fd2e0a" class="outline-3">
<h3 id="org4fd2e0a"><span class="section-number-3">2.15.</span> The defined Function</h3>
<div class="outline-text-3" id="text-2-15">
<p>
<code>&lt;STDIN&gt;</code> 操作通常会返回一个字符串，但是也有特例。当你在扫描一个文件时，如果遇到 <code>EOF</code> ，那么 <code>&lt;STDIN&gt;</code> 会返回 <code>undef</code> ，这时你可以用 <code>defined()</code> 函数来判断某个变量是否被赋值。
<code>defined()</code> 当输入的值为 <code>undef</code> 时返回假，其他情况均返回真。
</p>

<p>
当然，你也可以为某个变量赋值 <code>undef</code> ，虽然这与没声明该变量没有什么区别，但是某些情况下这个特性是很有用的。
</p>
</div>
</div>
</div>
