articles/Learning-Perl.org
* CH.3 List and Arrays
首先我觉得需要澄清一下的是，在Perl社区中，List和Array其实通常可以互相代换。
但是严格意义上来说，List是一些Scalar Data按照一定的顺序排列在一起组成的数据结构，而Array是指向某个List的变量。
例如：

#+BEGIN_SRC perl
  @an_array = qw[this that foo bar];    #这是一个数列
  print $an_array[1];                   #输出 "that"
#+END_SRC

两者之间并没有一个十分严格的界限，所以书中也写道：

#+BEGIN_QUOTE
 A list is an ordered collection of scalars. An array is a variable that contains a list. In Perl, the two terms are often used as if they’re interchangeable. But, to be accurate, the list is the data, and the array is the variable.
#+END_QUOTE

** List
列表中的每一个元素都是一个 =Scalar Variable= 而且拥有一个 =Scalar value=, 这些变量是有一定顺序的，而且从零开始计数。
列表中的元素不一定要是同一种类型，数字，字符串， =undef= 都是可以放到同一个列表中的。
Perl不对列表的大小做限制，只要你的内存是足够的，你可以创建一个任意大的列表。所以最小的列表就是那些没有任何元素的列表。
** 调用数列中的元素
Perl调用数列元素的方式也很简单，例如：

#+BEGIN_SRC perl
$foo[0]="foo";
$foo[1]="bar";
print $foo[1];    #输出 "bar"
#+END_SRC

在Perl当中， =Array= 和 =Scalar Variable= 使用的是两种不同的命名域，所以你可以使某个变量和数列使用同一个名字。
例如：

#+BEGIN_SRC perl
$foo="foo";
$foo[0]="bar";
print $foo.$foo[0];    #结果会输出 "foobar"
#+END_SRC

但是为了你的代码的可维护性，没人会建议你这么做。

在调用数列元素的时候，你也可以在 =index= 的位置输入字符串或者浮点数或者是其他变量，Perl会自动转换为对应的整数。
例如：

#+BEGIN_SRC perl
$foo[0]="foo";
$foo[1]="bar";
$the_number=1.618
print $foo[$the_number-1].$foo["1H4T3SCH00L"]    #结果会输出 "foobar"
#+END_SRC

当调用超出数列元素数的元素时，Perl会返回 =undef= .
例如：

#+BEGIN_SRC perl
$foo[0]=0;
$foo[1]=1;
if(!defined($foo[99])){
    print "Not defined!";}    #结果会输出 "Not defined!"
#+END_SRC

** Special Array Indices
在Perl中，当你给一个超出数列范围的元素赋值时，数列会自动扩张到合适的大小并给对应的元素赋值，而且新增加的元素会被赋值为 =undef= 。例如：

#+BEGIN_SRC perl
$foo[0]="foo";
$foo[1]="bar";
$foo[99]="well that was quite a gap!";
# 从 $foo[2] 到 $foo[98] 之间的元素均为 undef
#+END_SRC
