public/articles/Learning-Perl.html

<div id="outline-container-org70813c4" class="outline-2">
<h2 id="org70813c4"><span class="section-number-2">3.</span> CH.3 List and Arrays</h2>
<div class="outline-text-2" id="text-3">
<p>
首先我觉得需要澄清一下的是，在Perl社区中，List和Array其实通常可以互相代换。
但是严格意义上来说，List是一些Scalar Data按照一定的顺序排列在一起组成的数据结构，而Array是指向某个List的变量。
例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">@<span style="color: #79a8ff; text-decoration: underline;">an_array</span> = qw<span style="color: #00c06f;">[this that foo bar]</span>;    <span style="color: #a8a8a8;">#&#36825;&#26159;&#19968;&#20010;&#25968;&#21015;</span>
print $<span style="color: #79a8ff;">an_array</span>[1];                   <span style="color: #a8a8a8;">#&#36755;&#20986; "that"</span>
</pre>
</div>

<p>
两者之间并没有一个十分严格的界限，所以书中也写道：
</p>

<blockquote>
<p>
A list is an ordered collection of scalars. An array is a variable that contains a list. In Perl, the two terms are often used as if they’re interchangeable. But, to be accurate, the list is the data, and the array is the variable.
</p>
</blockquote>
</div>

<div id="outline-container-orgf9ccf2b" class="outline-3">
<h3 id="orgf9ccf2b"><span class="section-number-3">3.1.</span> List</h3>
<div class="outline-text-3" id="text-3-1">
<p>
列表中的每一个元素都是一个 <code>Scalar Variable</code> 而且拥有一个 <code>Scalar value</code>, 这些变量是有一定顺序的，而且从零开始计数。
列表中的元素不一定要是同一种类型，数字，字符串， <code>undef</code> 都是可以放到同一个列表中的。
Perl不对列表的大小做限制，只要你的内存是足够的，你可以创建一个任意大的列表。所以最小的列表就是那些没有任何元素的列表。
</p>
</div>
</div>
<div id="outline-container-org4acef21" class="outline-3">
<h3 id="org4acef21"><span class="section-number-3">3.2.</span> 调用数列中的元素</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Perl调用数列元素的方式也很简单，例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span>[0]=<span style="color: #00c06f;">"foo"</span>;
$<span style="color: #79a8ff;">foo</span>[1]=<span style="color: #00c06f;">"bar"</span>;
print $<span style="color: #79a8ff;">foo</span>[1];    <span style="color: #a8a8a8;">#&#36755;&#20986; "bar"</span>
</pre>
</div>

<p>
在Perl当中， <code>Array</code> 和 <code>Scalar Variable</code> 使用的是两种不同的命名域，所以你可以使某个变量和数列使用同一个名字。
例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span>=<span style="color: #00c06f;">"foo"</span>;
$<span style="color: #79a8ff;">foo</span>[0]=<span style="color: #00c06f;">"bar"</span>;
print $<span style="color: #79a8ff;">foo</span>.$<span style="color: #79a8ff;">foo</span>[0];    <span style="color: #a8a8a8;">#&#32467;&#26524;&#20250;&#36755;&#20986; "foobar"</span>
</pre>
</div>

<p>
但是为了你的代码的可维护性，没人会建议你这么做。
</p>

<p>
在调用数列元素的时候，你也可以在 <code>index</code> 的位置输入字符串或者浮点数或者是其他变量，Perl会自动转换为对应的整数。
例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span>[0]=<span style="color: #00c06f;">"foo"</span>;
$<span style="color: #79a8ff;">foo</span>[1]=<span style="color: #00c06f;">"bar"</span>;
$<span style="color: #79a8ff;">the_number</span>=1.618
print $<span style="color: #79a8ff;">foo</span>[$<span style="color: #79a8ff;">the_number</span>-1].$<span style="color: #79a8ff;">foo</span>[<span style="color: #00c06f;">"1H4T3SCH00L"</span>]    <span style="color: #a8a8a8;">#&#32467;&#26524;&#20250;&#36755;&#20986; "foobar"</span>
</pre>
</div>

<p>
当调用超出数列元素数的元素时，Perl会返回 <code>undef</code> .
例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span>[0]=0;
$<span style="color: #79a8ff;">foo</span>[1]=1;
<span style="color: #00d3d0;">if</span>(!defined($<span style="color: #79a8ff;">foo</span>[99])){
    print <span style="color: #00c06f;">"Not defined!"</span>;}    <span style="color: #a8a8a8;">#&#32467;&#26524;&#20250;&#36755;&#20986; "Not defined!"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org454aa94" class="outline-3">
<h3 id="org454aa94"><span class="section-number-3">3.3.</span> Special Array Indices</h3>
<div class="outline-text-3" id="text-3-3">
<p>
在Perl中，当你给一个超出数列范围的元素赋值时，数列会自动扩张到合适的大小并给对应的元素赋值，而且新增加的元素会被赋值为 <code>undef</code> 。例如：
</p>

<div class="org-src-container">
<pre class="src src-perl">$<span style="color: #79a8ff;">foo</span>[0]=<span style="color: #00c06f;">"foo"</span>;
$<span style="color: #79a8ff;">foo</span>[1]=<span style="color: #00c06f;">"bar"</span>;
$<span style="color: #79a8ff;">foo</span>[99]=<span style="color: #00c06f;">"well that was quite a gap!"</span>;
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">&#20174; $foo[2] &#21040; $foo[98] &#20043;&#38388;&#30340;&#20803;&#32032;&#22343;&#20026; undef</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-08-07 Sun 01:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
